from fastapi import APIRouter, HTTPException

router = APIRouter()

# 피드백 데이터 저장소
feedback_store = {
    "여성": {
        "폴로랄프로렌": {
            "반팔": {"커요": "3%", "보통이에요": "95%", "작아요": "2%"},
            "긴팔": {"커요": "6%", "보통이에요": "93%", "작아요": "1%"},
            "바지": {"커요": "35%", "보통이에요": "65%"}
        },
        "아디다스": {
            "반팔": {"커요": "1%", "보통이에요": "94%", "작아요": "4%"},
            "긴팔": {"커요": "5%", "보통이에요": "95%"},
            "바지": {"커요": "10%", "보통이에요": "90%"}
        },
        "나이키": {
            "반팔": {"커요": "16%", "보통이에요": "82%", "작아요": "3%"},
            "긴팔": {"커요": "20%", "보통이에요": "80%"},
            "바지": {"보통이에요": "84%", "작아요": "16"}
        },
        "Tommy hilfiger": {
            "반팔": {"보통이에요": "100%"},
            "긴팔": {"보통이에요": "100%"},
            "바지": {"커요": "17%", "보통이에요": "83%"}
        },
        "캘빈클라인": {
            "반팔": {"커요": "32%", "보통이에요": "67%"},
            "긴팔": {"보통이에요": "86%", "작아요": "14%"},
            "바지": {"커요": "7%", "보통이에요": "90%", "작아요": "3%"}
        },
        "saint laurent": {
            "반팔": {"커요": "%", "보통이에요": "86%", "작아요": "14%"},
            "긴팔": { "보통이에요": "90%", "작아요": "10%"},
            "바지": {"커요": "6%", "보통이에요": "92%", "작아요": "2%"}
        },
        "ami": {
            "반팔": {"커요": "50%", "보통이에요": "50%"},
            "긴팔": {"커요": "8%", "보통이에요": "85%", "작아요": "8%"},
        },
        "kenzo": {
            "반팔": {"커요": "30%", "보통이에요": "70%"},
            "긴팔": {"커요": "30%", "보통이에요": "70%"},
            "바지": {"보통이에요": "82%", "작아요": "18%"}
        },
        "메종키츠네": {
            "반팔": {"커요": "5%", "보통이에요": "95%"},
            "긴팔": {"보통이에요": "100%"},
            "바지": {"커요": "5%", "보통이에요": "95%"}
        },
    },
    "남성": {
        "폴로랄프로렌": {
            "반팔": {"커요": "3%", "보통이에요": "92%", "작아요": "5%"},
            "긴팔": {"커요": "20%", "보통이에요": "75%", "작아요": "5%"},
            "바지": {"커요": "16%", "보통이에요": "81%", "작아요": "2%"}
        },
        "아디다스": {
            "반팔": {"커요": "31%", "보통이에요": "69%"},
            "긴팔": {"커요": "22%", "보통이에요": "72%", "작아요": "6%"},
            "바지": {"커요": "25%", "보통이에요": "75%"}
        },
        "나이키": {
            "반팔": {"커요": "12%", "보통이에요": "88%"},
            "긴팔": {"커요": "14%", "보통이에요": "86%"},
            "바지": {"커요": "5%", "보통이에요": "92%", "작아요": "4%"}
        },
        "Tommy hilfiger": {
            "반팔": {"보통이에요": "100%"},
            "긴팔": {"커요": "46%", "보통이에요": "54%"},
            "바지": {"보통이에요": "100%"}
        },
        "캘빈클라인": {
            "반팔": {"커요": "32%", "보통이에요": "67%"},
            "긴팔": {"커요": "8%", "보통이에요": "88%", "작아요": "5%"},
        },
        "saint laurent": {
            "반팔": {"커요": "%", "보통이에요": "86%", "작아요": "14%"},
            "긴팔": { "보통이에요": "92%", "작아요": "8%"},
        },
        "ami": {
            "반팔": {"커요": "50%", "보통이에요": "50%"},
            "긴팔": {"커요": "27%", "보통이에요": "70%", "작아요": "3%"},
            "바지": {"보통이에요": "100%"}
        },
        "kenzo": {
            "반팔": {"커요": "30%", "보통이에요": "70%"},
            "긴팔": {"커요": "10%", "보통이에요": "90%"},
            "바지": {"커요": "50%", "보통이에요": "50%"}
        },
        "메종키츠네": {
            "반팔": {"커요": "5%", "보통이에요": "95%"},
            "긴팔": {"커요": "17%", "보통이에요": "83%"},
            "바지": {"커요": "10%", "보통이에요": "90%"}
        },
    }
}

# 전체 브랜드 목록을 제공하는 엔드포인트
@router.get("/brands")
async def get_brands():
    # 사용 가능한 모든 브랜드 목록을 생성
    all_brands = set(feedback_store["여성"].keys()).union(feedback_store["남성"].keys())
    
    return list(all_brands)

# 특정 성별, 브랜드, 카테고리에 대한 피드백을 제공하는 엔드포인트
@router.get("/brands/{gender}/{brand}/{category}")
async def get_brand_feedback(gender: str, brand: str, category: str):
    # 성별, 브랜드, 카테고리에 해당하는 피드백을 가져옴
    feedback_data = feedback_store.get(gender, {}).get(brand, {}).get(category, None)

    if feedback_data is None:
        raise HTTPException(status_code=404, detail="Feedback data not found for the given parameters")

    return feedback_data

# 특정 성별과 브랜드에 대해 가능한 카테고리를 제공하는 엔드포인트
@router.get("/categories/{gender}/{brand}")
async def get_available_categories(gender: str, brand: str):
    # 해당 성별과 브랜드에 대한 모든 카테고리 반환
    categories = feedback_store.get(gender, {}).get(brand, None)

    if categories is None:
        raise HTTPException(status_code=404, detail="No categories found for the given brand and gender")

    #"반팔", "긴팔", "바지" 카테고리만 필터링
    filtered_data = {k: v for k, v in categories.items() if k in ["반팔", "긴팔", "바지"]}
    
    return filtered_data
